**A tuple is collection of ordered,immutable, allows duplicates items,any datatypes **
* ()

In [2]:
our_tuple=('apple','banana','cherry')
print(our_tuple)

('apple', 'banana', 'cherry')

In [3]:
numbers=(100,130,100,230,130,400,500,100)

In [4]:
print('Number of items in tuple',len(numbers))

Number of items in tuple 8

In [6]:
print(numbers)

(100, 130, 100, 230, 130, 400, 500, 100)

In [5]:
print('Index of banana : ',our_tuple.index('banana'))

Index of banana :  1

In [7]:
#tuple.count(item): return number of times its appear in tuple
print('Frequency of 100 in numbers',numbers.count(100))

Frequency of 100 in numbers 3

In [10]:
product=(
    'Wireless Mike',
    'MVVI',
     400,
    4.6
)

In [12]:
print('Product Name \t Brand \t Price \t Rating')
for item in product:
  print(item,end='\t')

Product Name 	 Brand 	 Price 	 Rating
Wireless Mike	MVVI	400	4.6

In [13]:
# A list  of employees using tuple (id,name,salary,designation)
employees=(
    (1,'John',50000,'Manager'),
    (2,'Jane',60000,'Developer'),
    (3,'Bob',55000,'Tester'),
    (4,'Alice',70000,'Designer'),
    (5,'Sam',50000,'Developer')

)

In [14]:
for emp in employees:
  print(f'ID: \t {emp[0]}')
  print(f'Name: \t {emp[1]}')
  print(f'Salary: \t {emp[2]}')
  print(f'Designation: \t {emp[3]}')
  print('\n')

ID: 	 1
Name: 	 John
Salary: 	 50000
Designation: 	 Manager


ID: 	 2
Name: 	 Jane
Salary: 	 60000
Designation: 	 Developer


ID: 	 3
Name: 	 Bob
Salary: 	 55000
Designation: 	 Tester


ID: 	 4
Name: 	 Alice
Salary: 	 70000
Designation: 	 Designer


ID: 	 5
Name: 	 Sam
Salary: 	 50000
Designation: 	 Developer

**Write a BankTransactions Record Using Tuple**

---
* Saved 3 Transactions
* Transactions content: TransactionId,Name,Amount,Type,Date
* (e.g. TXN-001, Sam, 355.70,NetBanking, '2025-11-14')
* Show Stored Data